#include "window.h"



window::window()
{
}

window::window(string choose)
{
	if (choose == "0")
	{
		welcome = "********************学生成绩管理系统********************";
		menu[0] = "1. 录入信息";
		menu[1] = "2. 修改信息";
		menu[2] = "3. 查询信息";
		menu[3] = "4. 删除信息";
	}
	else if (choose == "01")
	{
		welcome = "********************录入信息********************";
		menu[0] = "1. 录入课程信息";
		menu[1] = "2. 录入学生信息";
		menu[2] = "3. 录入成绩";
		menu[3] = "4. 返回主菜单";
	}
	else if (choose == "02")
	{
		welcome = "********************修改信息********************";
		menu[0] = "1. 修改课程信息";
		menu[1] = "2. 修改学生信息";
		menu[2] = "3. 修改成绩";
		menu[3] = "4. 返回主菜单";
	}
	else if (choose == "03")
	{
		welcome = "********************查询信息********************";
		menu[0] = "1. 查询课程信息";
		menu[1] = "2. 查询学生信息";
		menu[2] = "3. 查询成绩";
		menu[3] = "4. 返回主菜单";
	}
	else if (choose == "04")
	{
		welcome = "********************删除信息********************";
		menu[0] = "1. 删除课程信息";
		menu[1] = "2. 删除学生信息";
		menu[2] = "3. 删除成绩";
		menu[3] = "4. 返回主菜单";
	}
	else if (choose == "011")
	{
		welcome = "********************录入课程信息********************";
	}
	else if (choose == "012")
	{
		welcome = "********************录入学生信息********************";
	}
	else if (choose == "013")
	{
		welcome = "********************录入成绩信息********************";
	}
	else if (choose == "0131")
	{
		welcome = "********************选择已有课程********************";
	}
	else if (choose == "0132")
	{
		welcome = "********************添加新的课程********************";
	}
	else if (choose == "021")
	{
		welcome = "********************修改课程信息********************";
	}
	else if (choose == "022")
	{
		welcome = "********************修改学生信息********************";
	}
	else if (choose == "023")
	{
		welcome = "********************修改成绩信息********************";
	}
	else if (choose == "031")
	{
		welcome = "********************查询课程信息********************";
	}
	else if (choose == "032")
	{
		welcome = "********************查询学生信息********************";
	}
	else if (choose == "033")
	{
		welcome = "********************查询成绩信息********************";
	}
}


window::~window()
{
}

void window::Display()
{
	std::cout << welcome << endl << endl;
	for (int i = 0; i < 4; i++)
		if (menu[i] != "\0")
			std::cout << menu[i] << endl;
}
